# Do git first to ensure latest version with security updates
brew "git", link: true, conflicts_with: ["git"] # Maybe?

tap "tedious-tools/formulae"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Command-line tools
brew "asdf"
brew "asdfler"
brew "jq"
brew "mas"
brew "postgresql"
brew "yadm"
brew "yq"
brew "zsh"
# brew "zsh-syntax-highlighting"

# Mac apps with casks
cask "1password"
cask "1password-cli" # No idea why this one is a cask instead of a formula
cask "alfred"
cask "anylist"
# Calibre is annoying because you have to download v3, get the plugin to work,
# then go back to v5
# cask "calibre"
cask "discord"
cask "element"
cask "insomnia"
cask "iterm2"
cask "mudlet"
cask "private-internet-access"
cask "raspberry-pi-imager"
cask "signal"
cask "slack"
cask "sublime-merge"
cask "sublime-text"
cask "the-unarchiver"
cask "zoom"

# Font casks
cask "font-menlo-for-powerline"
cask "fira-font-code"

# Mac App Store Apps
mas "Bear", id: 1091189122
